app/controllers/discovery/episodes_controller.rb

SELECT "editors".* FROM "editors" WHERE "editors"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "editors"."id", "editors"."email" FROM "editors" ORDER BY "editors"."email" ASC
SELECT "episodes".* FROM "episodes" WHERE "episodes"."active" = $1 AND "episodes"."category" = $2 AND "episodes"."editor_id" = $3 ORDER BY "episodes"."created_at" DESC LIMIT $4 OFFSET $5  [["active", true], ["category", "podcast"], ["editor_id", 3], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "episodes" WHERE "episodes"."active" = $1  [["active", true]]
---
    def index
      @q         = params[:q].to_s
      @category  = params[:category].to_s
      @editor_id = params[:editor_id].to_s

      base = Episode.active.includes(:editor).order(created_at: :desc).search_title(@q).by_category(@category).by_editor(@editor_id)

      @categories = Episode::CATEGORIES
      @editors    = Editor.order(:email)

      per_page = [[params[:per].to_i].max, 24].min
      @episodes = base.page(params[:page]).per(per_page.zero? ? 5 : per_page)

SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
      @episode = Episode.find(params[:id])