app/controllers/cms/episodes_controller.rb

SELECT "editors".* FROM "editors" WHERE "editors"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "episodes".* FROM "episodes" WHERE "episodes"."editor_id" != $1 ORDER BY "episodes"."created_at" DESC  [["editor_id", 1]]
---
    def index
      @tab = params[:tab].presence_in(%w[mine others]) || "mine"

      base_scope = Episode.with_attached_thumbnail_image.includes(:editor).order(created_at: :desc)

SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def show
      @episode = Episode.find(params[:id])

INSERT INTO "episodes" ("title", "description", "duration", "published_at", "source_url", "thumbnail_url", "editor_id", "created_at", "updated_at", "created_by_editor_id", "updated_by_editor_id", "category") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
INSERT INTO "episodes" ("title", "description", "duration", "published_at", "source_url", "thumbnail_url", "editor_id", "created_at", "updated_at", "created_by_editor_id", "updated_by_editor_id", "category", "source_kind", "active") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
    def create
      @episode = current_editor.episodes.build(episode_params)
      @episode.created_by_editor = current_editor
      @episode.updated_by_editor = current_editor
      if @episode.save

UPDATE "episodes" SET "updated_at" = $1, "updated_by_editor_id" = $2 WHERE "episodes"."id" = $3  [["updated_at", "2025-08-10 17:52:20.419822"], ["updated_by_editor_id", 1], ["id", 2]]
UPDATE "episodes" SET "updated_at" = $1, "updated_by_editor_id" = $2, "category" = $3 WHERE "episodes"."id" = $4  [["updated_at", "2025-08-12 00:41:32.041620"], ["updated_by_editor_id", 2], ["category", "podcast"], ["id", 7]]
---
    def update
      @episode.updated_by_editor = current_editor
      if @episode.update(episode_params)

SELECT "editors"."id", "editors"."email", "editors"."role" FROM "editors" ORDER BY "editors"."email" ASC
---
    def load_sidebar_data
      @all_editors = Editor.order(:email).select(:id, :email, :role)

SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_episode
      @episode = Episode.find(params[:id])